app/views/blogs/show.html.erb

<h2>Posts</h2>
<% @blog.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" = ?  [["blog_id", 2]]