app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("blog_title", "created_at", "updated_at") VALUES (?, ?, ?)  [["blog_title", "jknkj"], ["created_at", "2015-10-10 10:44:15.227671"], ["updated_at", "2015-10-10 10:44:15.227671"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save