app/controllers/posts_controller.rb

  def index
 # find the blog for the id provided
 @blog = Blog.find(params[:blog_id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 2]]

 def show
 @blog = Blog.find(params[:blog_id])
 # Find an post in blogs 1 that has id=2
 @post = @blog.posts.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."blog_id" = ? AND "posts"."id" = ? LIMIT 1  [["blog_id", 5], ["id", 6]]

 def new
 @blog = Blog.find(params[:blog_id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 2]]

 def create
 @blog = Blog.find(params[:blog_id])

 @post = @blog.posts.build(posts_params)
 if @post.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "posts" ("post_message", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_message", "okopk"], ["blog_id", 2], ["created_at", "2015-10-10 10:53:43.755560"], ["updated_at", "2015-10-10 10:53:43.755560"]]

 def destroy
 @blog = Blog.find(params[:blog_id])
 @post = Post.find(params[:id])
 @post.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]